import React from 'react'
import style from './cardsBlogsListStyle.module.css'
import { useGlobalState } from '../../../State/State';

const AboutWeDesc = (props) => {
  const [darkMode, setDarkMode] = useGlobalState('DarkMode');
  return (
    <div className={style.holderGap}>
      <p data-theme={darkMode ? "dark" : "lightMode"}>در دنیای امروز که فناوری‌های نوین به سرعت در حال تغییر و پیشرفت هستند، توانایی تسلط بر مهارت‌های برنامه‌نویسی و تکنولوژی‌های دیجیتال یکی از مهم‌ترین نیازهای فردی و حرفه‌ای به شمار می‌آید. آکادمی سپهر با درک عمیق از این نیازها و با هدف ایجاد بستری برای یادگیری عمیق و ترویج آموزش رایگان در ایران، تأسیس شده است تا فضایی را فراهم کند که همه افراد علاقه‌مند به دنیای فناوری، بدون توجه به سطح مهارت یا تجربه قبلی، بتوانند در آن دانش و توانایی‌های خود را توسعه دهند. در آکادمی سپهر بیش از 700 ساعت آموزش رایگان فارسی برنامه نویسی وجود دارد و میتواند برای شروع مسیر یادگیری برنامه نویسی بسیار مفید باشد.</p>
      <p data-theme={darkMode ? "dark" : "lightMode"}>آکادمی سپهر با بهره‌گیری از مجرب ترین مدرسین و پشتیبانی حرفه ای، محیطی پویا و تعاملی را برای یادگیری آنلاین ارائه می‌دهد. ما بر این باور هستیم که یادگیری نباید محدود به چهارچوب‌های سنتی کلاس‌های حضوری باشد و هر فرد باید بتواند با توجه به سبک زندگی و نیازهای خود به آموزش‌های با کیفیت و روز دنیا دسترسی داشته باشد. به همین دلیل، آکادمی سپهر پلتفرم آنلاینی را فراهم کرده است که علاقه مندان به برنامه نویسی و دنیای تکنولوژی و دیجیتال مارکتینگ از هر نقطه جهان به راحتی به آن دسترسی دارند و می‌توانند از محتوای آموزشی متنوع ما بهره‌مند شوند.</p>
    </div>
  )
}

export {AboutWeDesc}