import React from 'react'
import style from './cardsBlogsListStyle.module.css'
import { useGlobalState } from '../../../State/State';

const Teaching = (props) => {
  const [darkMode, setDarkMode] = useGlobalState('DarkMode');
  return (
    <div className={style.holderP}>
      <span data-theme={darkMode ? "dark" : "lightMode"}>رویکرد آموزشی ما</span>
      <div className={style.holderGap}>
        <p className={style.courseCounts} data-theme={darkMode ? "dark" : "lightMode"}>آکادمی سپهر از ابتدا با تمرکز بر ارائه آموزش‌های عملی و کاربردی بنا شده است. ما بر این باوریم که یادگیری نباید صرفاً به تئوری محدود شود؛ بلکه ترکیبی از تئوری و تمرین عملی است که می‌تواند یک یادگیرنده را به سطح مطلوبی از مهارت برساند. دوره‌های ما به گونه‌ای طراحی شده‌اند که دانشجویان پس از اتمام هر دوره، بتوانند با اعتماد به نفس کافی پروژه‌های واقعی را به تنهایی انجام دهند و آن‌ها را در رزومه خود قرار دهند.</p> 
        <p className={style.courseCounts} data-theme={darkMode ? "dark" : "lightMode"}>یکی از ویژگی‌های بارز دوره‌های آموزشی آکادمی سپهر، پشتیبانی کامل و تعامل با اساتید و دیگر فراگیران است. ما از یک رویکرد تعاملی استفاده می‌کنیم تا دانشجویان بتوانند در هر مرحله از یادگیری، از پشتیبانی کامل بهره‌مند شوند و سوالات و چالش‌های خود را با تیم آموزشی و دیگر دانشجویان در میان بگذارند. این رویکرد باعث می‌شود که یادگیری به یک تجربه مشارکتی و تعاملی تبدیل شود که در آن هر فرد می‌تواند از تجربیات دیگران نیز بهره‌مند شود. برای همین تمام دوره های پولی آکادمی سپهر دارای گروه پشتیبانی تلگرام هستند و دانشجویان میتوانند بصورت مستقیم با مدرس دوره در ارتباط باشند.</p> 
      </div>
    </div>  
  )
}

export {Teaching}